{
	"name": "ShuffleDeck",
	"tagName": "x-shuffledeck",
	"version": "0.1.0",
	"author": "Leon Zhang",
	"description": "A box in which slides can be cycled and replaced with in a variety of different orders and transitions",
	"demo": "demo/shuffledeck-demo.html",
	"categories": [
        "ui"
    ],
	"compatibility": {
		"firefox": 5,
		"chrome": 4,
		"ie": 9,
		"opera": 12,
		"android": 2.1,
		"ios": 4
	},
	"documentation": {
		"description": "A box in which slides can be cycled and replaced with in a variety of different orders and transitions",
		"attributes": {
            "transition-type" : "Defines the kind of transition animation that is used when cycling slides. Valid options: 'scrollLeft', 'scrollUp', 'scrollRight', 'scrollDown', 'flipX', 'flipY', 'none'"
        },
		"events": {
            "x-shuffledeck:slideend": "fired when a slide transition animation has finished"
        },
		"methods": {
            "slideTo" : "Transitions to the x-shuffleslide at the given index. If given a progressType of 'forward', will perform the forwards animation. If given 'reverse', will performs the reverse animation. If the progressType is 'auto' or omitted, will perform forward animation if going to a larger index, and will perform reverse animation if going to a smaller index. Also takes an optional callback function.",
            "slideNext" : "Transitions to the next x-shuffleslide in the deck. Takes an optional progressType of 'forward', 'reverse', or 'auto'. Also takes an optional callback function.",
            "slideNext" : "Transitions to the previous x-shuffleslide in the deck. Takes an optional progressType of 'forward', 'reverse', or 'auto'. Also takes an optional callback function.",
            "getAllSlides" : "Returns a list of all x-shuffleslide elements in the deck.",
            "getSelectedSlide" : "Returns the currently selected x-shuffleslide in the deck.",
            "getSlideIndex" : "Given an x-shuffleslide element, returns its index in this deck, if it is a child element.",
            "appendSlide" : "Given an x-shuffleslide element, appends it as the last such slide in the deck.",
            "removeSlideFrom" : "Given an index of an existing x-shuffleslide element, removes it from the deck. If the removed slide also happens to the be the curent slide, the deck will jump to the previous still-existing slide. Also takes an optional callback function."
        },
		"getters": {
            "transition-type" : "Returns the kind of transition animation that is used when cycling slides. Valid options: 'scrollLeft', 'scrollUp', 'scrollRight', 'scrollDown', 'flipX', 'flipY', 'none'"
        },
		"setters": {
            "transition-type" : "Sets the kind of transition animation that is used when cycling slides. Valid options: 'scrollLeft', 'scrollUp', 'scrollRight', 'scrollDown', 'flipX', 'flipY', 'none'"
        }
	}
}