{
	"name": "IconButton",
	"tagName": "x-iconbutton",
	"version": "0.1.0",
	"author": "Leon Zhang",
	"description": "A button with an anchored icon in addition to a label",
	"demo": "demo/iconbutton-demo.html",
	"categories": [
        "ui"
    ],
	"compatibility": {
		"firefox": 5,
		"chrome": 4,
		"ie": 9,
		"opera": 12,
		"android": 2.1,
		"ios": 4
	},
	"documentation": {
		"description": "A button with an anchored icon in addition to a label, allowing users to specify button with icons with having to worry about the exact CSS behind the layout",
		"attributes": {
            "src" : "Defines the image source to use as the button's icon. Only does something if the icon is a <img> element (which is the default behavior)",
            "icon-anchor" : "Defines the location of the icon relative to the label. Valid options are 'left', 'top', 'right', 'bottom'"
        },
		"events": {},
		"methods": {},
		"getters": {
            "src" : "Returns the image source used as the button's icon. Only does something if the icon is a <img> element (which is the default behavior)",
            "icon-anchor" : "Returns the location of the icon relative to the label. Valid options are 'left', 'top', 'right', 'bottom'",
            "icon" : "Returns the DOM element representing the button's icon",
            "label" : "Returns the DOM element representing the button's label",
            "text" : "Returns the text content of the button, as defined by the textGetter",
            "textGetter" : "Returns the function used to calculate how to read the button's text contents",
            "textSetter" : "Returns the function used to calculate how to change the button's text contents"
        },
		"setters": {
            "src" : "Sets the image source used as the button's icon. Only does something if the icon is a <img> element (which is the default behavior)",
            "icon-anchor" : "Sets the location of the icon relative to the label. Valid options are 'left', 'top', 'right', 'bottom'",
            "icon" : "Replaces the DOM element representing the button's icon with the given DOM element",
            "label" : "Replaces the DOM element representing the button's label with the given DOM element",
            "text" : "Replaces the text content of the button, as defined by the textSetter",
            "textGetter" : "Replaces the function used to calculate how to read the button's text contents",
            "textSetter" : "Replaces the function used to calculate how to change the button's text contents"
        }
	}
}