{
	"name": "Datepicker",
	"tagName": "x-datepicker",
	"version": "0.1.0",
	"author": "Leon Zhang",
	"description": "A polyfill for <input type='date'> utilizing the x-calendar component.",
	"demo": "demo/index.html",
	"categories": [
  	"ui"
  ],
  "dependencies": [
  	"calendar"
  ],
	"compatibility": {
		"firefox": 5,
		"chrome": 4,
		"ie": 9,
		"opera": 12,
		"android": 2.1,
		"ios": 4
	},
	"documentation": {
		"description": "A polyfill for <input type='date'> utilizing the x-calendar component.",
		"attributes": {
			"name": "Indicates the name of the input to use. This is the default keyname that will be submitted if submitted through a form.",
			"value": "Indicates the currently displayed value of the datepicker. Can also be used to initialize a certain value.",
			"polyfill": "Indicates whether or not the datepicker is using a polyfill UI or not. While this is set automatically, this can also be set in markup to force the datepicker to always use its polyfill UI version."
		},
		"events": {
			"input": "Fired by the <x-datepicker> any time the user selects a date. Also fired as the user types in a date.",
			"change": "Fired by the <x-datepicker> whenever the submitValue of the datepicker changes or when the value is finalized. In other words, while input fires as the user types, change only fires if this changes the date selected by the datepicker, or if the user hits enter/leaves the datepicker's focus and the date gets parsed into ISO format."
		},
		"methods": {
			
		},
		"getters": {
			"name": "Retrieves the current name of the datepicker element. This is required for a value to be submitted to a default form.",
			"value": "Retrieves the currently displayed value of the datepicker element. Note that this may not necessarily be the value that would be submitted to a form. For example, if the user is currently typing 'July 4, 2013' and hasn't left focus yet, the value is 'July 4, 2013', not '2013-07-04'.",
			"submitValue": "Retrieves the value that the datepicker should submit to a form. For example, if the user is currently typing 'July 4, 2013' and hasn't left focus yet, the submitValue is '2013-07-04', not 'July 4, 2013'. Also note that unless the datepicker has a 'name' attribute, this does not guarantee that this will actually be submitted to a form.",
			"polyfill": "Retrieves whether or not the datepicker is currently using the polyfill version of its UI or not.",
			"labels": "Much like an `<x-calendar>`'s `.labels` property, `<x-datepicker>`s also have a `.labels` property to allow relabeling/localization of the component. \n The format and interface for the datepicker's `.labels` property is near identical to `<x-calendar>`'s `.labels` property, so it would be best to read the calendar's labels documentation for full details."
		},
		"setters": {
			"name": "Sets the current name of the datepicker element. This is required for a value to be submitted to a default form.",
			"value": "Sets the currently displayed value of the datepicker element. Note that submitValue will still return the correct parsed version of the new value (ie: ISO-format string if valid, empty stirng otherwise)",
			"polyfill": "Sets whether or not the datepicker is currently using the polyfill version of its UI or not."
		}
	}
}